#Бєлік Максим КН-32/1

import re
#Бєлік Максим КН-32/1
def student1_obrobka(text): #функція обробки від першого студента
    if not text.isalpha():
        # Очищення тексту від небажаних символів
        new_text = re.sub(r'[^a-zA-Zа-яА-ЯёЁіІїЇєЄ ]', '', text)
        # Перетворення тексту на верхній регістр
        new_text = new_text.upper()
        # Замінює всі входження 'A' на '!'
        new_text = new_text.replace('А', '!')
        print("Текст після обробки першим студентом: ")
        print(new_text)
    else:
        print("Текст містить тільки літери та не потребує зайвих символів.")

#Бєлік Максим КН-32/1
# Вихідний текст
text = """XXI століття – період глобальної інформатизації суспільства. Важко уявити сучасне життя без комп’ютера, 
основою роботи якого є програмне забезпечення. Програмування сьогодні є одним із найперспективніших видів діяльності, 
адже потреби людства у автоматизації різних процесів невпинно зростають. Крім того, програмування розвиває творчий 
підхід, логічне мислення та вміння розв’язувати проблеми. Неабияку популярність у світі програмування здобуває 
кросплатформність."""

#Бєлік Максим КН-32/1
# Виклик функції
student1_obrobka(text)

"""Використані функції: re.sub(pattern, replacement, string):
Призначення: Замінює всі частини рядка, що відповідають регулярному виразу pattern, на рядок replacement.

upper():
Призначення: Перетворює всі літери в рядку на великі.

replace(old, new):
Призначення: Замінює всі входження підрядка old на підрядок new у рядку.

Наступним студентам необхідно застосувати такі три функції: lower(), capitalize(), list() """

